      * #3754: stand-in for the BMS attribute, color and highlight
      * constants. Values mirror the documented symbolic ones; the
      * harness compares screen DATA fields, not attribute bytes.
       01  DFHBMSCA.
           02 DFHBMPEM PIC X VALUE X'19'.
           02 DFHBMPNL PIC X VALUE X'15'.
           02 DFHBMPFF PIC X VALUE X'0C'.
           02 DFHBMPCR PIC X VALUE X'0D'.
           02 DFHBMASK PIC X VALUE '0'.
           02 DFHBMUNP PIC X VALUE ' '.
           02 DFHBMUNN PIC X VALUE '&'.
           02 DFHBMPRO PIC X VALUE '-'.
           02 DFHBMBRY PIC X VALUE 'H'.
           02 DFHBMDAR PIC X VALUE '<'.
           02 DFHBMFSE PIC X VALUE 'A'.
           02 DFHBMPRF PIC X VALUE '/'.
           02 DFHBMASF PIC X VALUE '1'.
           02 DFHBMASB PIC X VALUE '8'.
           02 DFHBMEOF PIC X VALUE X'80'.
           02 DFHBMCUR PIC X VALUE X'02'.
           02 DFHBMEC  PIC X VALUE X'82'.
           02 DFHBMFLG PIC X VALUE X'00'.
           02 DFHBMDET PIC X VALUE X'FF'.
           02 DFHSA    PIC X VALUE X'28'.
           02 DFHCOLOR PIC X VALUE X'42'.
           02 DFHPS    PIC X VALUE X'43'.
           02 DFHHLT   PIC X VALUE X'41'.
           02 DFH3270  PIC X VALUE X'C0'.
           02 DFHVAL   PIC X VALUE X'C1'.
           02 DFHOUTLN PIC X VALUE X'C2'.
           02 DFHBKTRN PIC X VALUE X'46'.
           02 DFHALL   PIC X VALUE X'00'.
           02 DFHERROR PIC X VALUE X'3F'.
           02 DFHDFT   PIC X VALUE X'FF'.
           02 DFHDFCOL PIC X VALUE X'00'.
           02 DFHBLUE  PIC X VALUE '1'.
           02 DFHRED   PIC X VALUE '2'.
           02 DFHPINK  PIC X VALUE '3'.
           02 DFHGREEN PIC X VALUE '4'.
           02 DFHTURQ  PIC X VALUE '5'.
           02 DFHYELLO PIC X VALUE '6'.
           02 DFHNEUTR PIC X VALUE '7'.
           02 DFHBASE  PIC X VALUE X'00'.
           02 DFHDFHI  PIC X VALUE X'00'.
           02 DFHBLINK PIC X VALUE '1'.
           02 DFHREVRS PIC X VALUE '2'.
           02 DFHUNDLN PIC X VALUE '4'.
           02 DFHMFIL  PIC X VALUE X'04'.
           02 DFHMENT  PIC X VALUE X'02'.
           02 DFHMFE   PIC X VALUE X'06'.
           02 DFHUNNOD PIC X VALUE '('.
           02 DFHUNIMD PIC X VALUE 'I'.
           02 DFHUNNUM PIC X VALUE 'J'.
           02 DFHUNNUB PIC X VALUE 'Q'.
           02 DFHUNINT PIC X VALUE 'R'.
           02 DFHUNNON PIC X VALUE ')'.
           02 DFHPROTI PIC X VALUE 'Y'.
           02 DFHPROTN PIC X VALUE '%'.
           02 DFHMT    PIC X VALUE X'01'.
           02 DFHMFT   PIC X VALUE X'05'.
           02 DFHMET   PIC X VALUE X'03'.
           02 DFHMFET  PIC X VALUE X'07'.
           02 DFHDFFR  PIC X VALUE X'00'.
           02 DFHUNDER PIC X VALUE X'01'.
           02 DFHRIGHT PIC X VALUE X'02'.
           02 DFHOVER  PIC X VALUE X'04'.
           02 DFHLEFT  PIC X VALUE X'08'.
           02 DFHBOX   PIC X VALUE X'0F'.
           02 DFHSOSI  PIC X VALUE X'01'.
           02 DFHTRANS PIC X VALUE '0'.
           02 DFHOPAQ  PIC X VALUE X'FF'.
