//JOBA     JOB (ACCT),'NIGHTLY'
//STEPA    EXEC PGM=PGMA
//FILEA    DD DSN=PROD.CUSTA.DATA,DISP=SHR
//OUTA     DD DSN=PROD.YEARA(+1),DISP=(NEW,CATLG)
