       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASGPATH.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT TEST-FILE ASSIGN "./TEST-FILE"
                  ORGANIZATION SEQUENTIAL
                  FILE STATUS F-STATUS.
       DATA DIVISION.
       FILE SECTION.
       FD TEST-FILE.
       01 TEST-RECORD PIC X(10).
       WORKING-STORAGE SECTION.
       77 F-STATUS PIC X(02).
       PROCEDURE DIVISION.
           OPEN I-O TEST-FILE.
           DISPLAY F-STATUS.
           CLOSE TEST-FILE.
           STOP RUN.
