//UOWDEMO  JOB (COBOL),'UOWDEMO',CLASS=A,MSGCLASS=H
//STEP1    EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//INPFILE  DD DSN=GGUOW.INPFILE,DISP=SHR
//SYSTSIN  DD *
     DSN SYSTEM(DB2P)
          RUN PROGRAM(UOWDEMO) PLAN(GGUOW)
/*
