 PGMA: PROC OPTIONS(MAIN);
   DCL 1 CUSTREC,
         2 CUSTNO        CHAR(8),
         2 AMOUNTA       FIXED DEC(9,2),
         2 YEARA         FIXED BIN(15);
   %INCLUDE INCA;
   CALL PROCA;
   EXEC CICS READ FILE('FILEA') INTO(CUSTREC) RIDFLD(CUSTNO);
   EXEC CICS XCTL PROGRAM('PGMB');
 PROCA: PROC;
   AMOUNTA = AMOUNTA + 1;
 END PROCA;
 END PGMA;
